backToBasics/system/controlDict
FoamFile
{
  version   2.0;
  format    ascii;
  class     dictionary;
  location  "system";
  object    controlDict;
}

application       sonicFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           10;

deltaT            0.002;

writeControl      runTime;

writeInterval     0.5;

purgeWrite        0;

writeFormat       binary;

writePrecision    6;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable true;

functions
{
  libs ("libfieldFunctionObjects.so");

  Ma
  {
    type            MachNo;
    executeControl  writeTime;
    writeControl    writeTime;
  }
}
