backToBasics/system/blockMeshDict
FoamFile
{
	version			2.0;
	format			ascii;
	class				dictionary;
	object			blockMeshDict;
}

converToMeters 1;


vertices
(
	(0 0 0)
	(0 1.21011 -0.0523572)
	(0 1.21011 0.0523572)
	(9.15334 0 0)
	(9.15334 2.99954 -0.0523572)
	(9.15334 2.99954 0.0523572)
	(9.15334 9.99848 -0.174524)
	(9.15334 9.99848 0.174524)
	(30 0 0)
	(30 2.99954 -0.0523572)
	(30 2.99954 0.0523572)
	(30 9.99848 -0.174524)
	(30 9.99848 0.174524)
);


blocks
(
	hex (0 1 2 0 3 4 5 3) (5 1 100) simpleGrading (0.1 1 10)
	hex (3 4 5 3 8 9 10 8) (5 1 1000) simpleGrading (0.1 1 100)
	hex (4 6 7 5 9 11 12 10) (5 1 1000) simpleGrading (0.1 1 100)
);


edges
(
	arc 1 2 (0 1.2102 0)
	arc 4 5 (9.15334 3. 0)
	arc 6 7 (9.15334 10 0)
	arc 9 10 (30 3. 0)
	arc 11 12 (30 10 0)
	BSpline 1 4
(
		(0. 1.20993 -0.0211194)
		(0.061594 1.21007 -0.0211218)
		(0.125168 1.21266 -0.0211671)
		(0.190926 1.21783 -0.0212573)
		(0.259072 1.22567 -0.0213941)
		(0.32981 1.23629 -0.0215796)
		(0.403344 1.24981 -0.0218155)
		(0.479854 1.26629 -0.0221031)
		(0.559424 1.28563 -0.0224407)
		(0.642114 1.30771 -0.0228261)
		(0.727984 1.33239 -0.0232569)
		(0.817094 1.35954 -0.0237309)
		(0.909504 1.38904 -0.0242457)
		(1.00527 1.42074 -0.0247991)
		(1.10446 1.45451 -0.0253886)
		(1.20713 1.49023 -0.0260121)
		(1.31334 1.52777 -0.0266673)
		(1.42315 1.56698 -0.0273517)
		(1.53662 1.60774 -0.0280632)
		(1.65381 1.64991 -0.0287994)
		(1.77478 1.69337 -0.029558)
		(1.89959 1.73799 -0.0303366)
		(2.0283 1.78362 -0.0311331)
		(2.16097 1.83014 -0.0319451)
		(2.29766 1.87741 -0.0327703)
		(2.43843 1.92531 -0.0336064)
		(2.58334 1.9737 -0.0344511)
		(2.73245 2.02245 -0.035302)
		(2.88582 2.07143 -0.0361569)
		(3.04351 2.1205 -0.0370135)
		(3.20558 2.16954 -0.0378695)
		(3.37209 2.21841 -0.0387225)
		(3.5431 2.26698 -0.0395703)
		(3.71867 2.31512 -0.0404106)
		(3.89886 2.3627 -0.041241)
		(4.08373 2.40957 -0.0420593)
		(4.27334 2.45563 -0.0428631)
		(4.46775 2.50072 -0.0436502)
		(4.66702 2.54472 -0.0444182)
		(4.87121 2.58749 -0.0451648)
		(5.08038 2.62891 -0.0458878)
		(5.29459 2.66884 -0.0465848)
		(5.5139 2.70716 -0.0472536)
		(5.73837 2.74372 -0.0478917)
		(5.96806 2.77839 -0.048497)
		(6.20303 2.81105 -0.0490671)
		(6.44334 2.84157 -0.0495997)
		(6.68905 2.8698 -0.0500926)
		(6.94022 2.89562 -0.0505433)
		(7.19691 2.9189 -0.0509496)
		(7.45918 2.9395 -0.0513092)
		(7.72709 2.9573 -0.0516199)
		(8.0007 2.97216 -0.0518792)
		(8.28007 2.98394 -0.0520849)
		(8.56526 2.99252 -0.0522346)
		(8.85633 2.99777 -0.0523262)
		(9.15334 2.99954 -0.0523572)
	)
	BSpline 2 5
(
		(0. 1.20993 0.0211194)
		(0.061594 1.21007 0.0211218)
		(0.125168 1.21266 0.0211671)
		(0.190926 1.21783 0.0212573)
		(0.259072 1.22567 0.0213941)
		(0.32981 1.23629 0.0215796)
		(0.403344 1.24981 0.0218155)
		(0.479854 1.26629 0.0221031)
		(0.559424 1.28563 0.0224407)
		(0.642114 1.30771 0.0228261)
		(0.727984 1.33239 0.0232569)
		(0.817094 1.35954 0.0237309)
		(0.909504 1.38904 0.0242457)
		(1.00527 1.42074 0.0247991)
		(1.10446 1.45451 0.0253886)
		(1.20713 1.49023 0.0260121)
		(1.31334 1.52777 0.0266673)
		(1.42315 1.56698 0.0273517)
		(1.53662 1.60774 0.0280632)
		(1.65381 1.64991 0.0287994)
		(1.77478 1.69337 0.029558)
		(1.89959 1.73799 0.0303366)
		(2.0283 1.78362 0.0311331)
		(2.16097 1.83014 0.0319451)
		(2.29766 1.87741 0.0327703)
		(2.43843 1.92531 0.0336064)
		(2.58334 1.9737 0.0344511)
		(2.73245 2.02245 0.035302)
		(2.88582 2.07143 0.0361569)
		(3.04351 2.1205 0.0370135)
		(3.20558 2.16954 0.0378695)
		(3.37209 2.21841 0.0387225)
		(3.5431 2.26698 0.0395703)
		(3.71867 2.31512 0.0404106)
		(3.89886 2.3627 0.041241)
		(4.08373 2.40957 0.0420593)
		(4.27334 2.45563 0.0428631)
		(4.46775 2.50072 0.0436502)
		(4.66702 2.54472 0.0444182)
		(4.87121 2.58749 0.0451648)
		(5.08038 2.62891 0.0458878)
		(5.29459 2.66884 0.0465848)
		(5.5139 2.70716 0.0472536)
		(5.73837 2.74372 0.0478917)
		(5.96806 2.77839 0.048497)
		(6.20303 2.81105 0.0490671)
		(6.44334 2.84157 0.0495997)
		(6.68905 2.8698 0.0500926)
		(6.94022 2.89562 0.0505433)
		(7.19691 2.9189 0.0509496)
		(7.45918 2.9395 0.0513092)
		(7.72709 2.9573 0.0516199)
		(8.0007 2.97216 0.0518792)
		(8.28007 2.98394 0.0520849)
		(8.56526 2.99252 0.0522346)
		(8.85633 2.99777 0.0523262)
		(9.15334 2.99954 0.0523572)
	)
);


boundary
(
	axis
	 {
		type		empty;
		faces
		(
			(0 3 3 0)
			(3 8 8 3)
		);
}
	inlet
	 {
		type		patch;
		faces
		(
			(0 0 2 1)
		);
}
	wall
	 {
		type		wall;
		faces
		(
			(2 5 4 1)
			(4 5 7 6)
			(7 12 11 6)
		);
}
	outlet
	 {
		type		patch;
		faces
		(
			(8 9 10 8)
			(9 11 12 10)
		);
}
	front
	 {
		type		wedge;
		faces
		(
			(0 3 5 2)
			(3 8 10 5)
			(5 10 12 7)
		);
}
	back
	 {
		type		wedge;
		faces
		(
			(0 1 4 3)
			(3 4 9 8)
			(9 4 6 11)
		);
}
);


mergePatchPairs
(
);
