backToBasics/0/U
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions    [0 1 -1 0 0 0 0];

internalField uniform (.5 0 0);

boundaryField
{
  axis
  {
    type  empty;
  }

  inlet
  {
    type  fixedValue;
    value uniform (1 0 0);
  }

  wall
  {
    type  zeroGradient;
  }

  outlet
  {
    type  zeroGradient;
  }

  front
  {
    type  wedge;
  }

  back
  {
    type  wedge;
  }
}
