backToBasics/0/p
FoamFile
{
  version       2.0;
  format        ascii;
  class         volScalarField;
  object        p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField uniform 1;

boundaryField
{
  axis
  {
    type  empty;
  }

  inlet
  {
    type  fixedValue;
    value uniform 1;
  }

  wall
  {
    type  zeroGradient;
  }

  outlet
  {
    type     zeroGradient;
  }

  front
  {
    type  wedge;
  }

  back
  {
    type  wedge;
  }
}
