backToBasics/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{
    axis
    {
      type    empty;
    }

    inlet
    {
      type    fixedValue;
      value   uniform 1;
    }

    wall
    {
      type    zeroGradient;
    }

    outlet
    {
      type    zeroGradient;
    }

    front
    {
      type    wedge;
    }

    back
    {
      type    wedge;
    }
}

// ************************************************************************* //
