backToBasics/system/fvSchemes
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}

gradSchemes
{
  default         Gauss linear;
}

divSchemes
{
  default         none;
  div(phi,U)      Gauss upwind;
  div(phid,p)     Gauss limitedLinear 1;
  div(phi,e)      Gauss limitedLinear 1;
  div(phi,K)      Gauss limitedLinear 1;
  div(phiv,p)     Gauss limitedLinear 1;
  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
  default         Gauss linear corrected;
}

interpolationSchemes
{
  default         linear;
}

snGradSchemes
{
  default         corrected;
}
