backToBasics/system/fvSolution
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  "p.*"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-06;
    relTol          0;
  }

  "(U|e).*"
  {
    $p;
    tolerance       1e-05;
    relTol          0;
  }

  "rho.*"
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-05;
    relTol          0;
  }
}


PIMPLE
{
  nOuterCorrectors          2;
  nCorrectors               1;
  nNonOrthoganalCorrectors  0;
}
